/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe {
            *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize)
        };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {

pub const BLPAPI_ERROR_LOGON_LOOKUP_FAILED: u32 = 17;
pub const BLPAPI_ERROR_DS_LOOKUP_FAILED: u32 = 18;
pub const BLPAPI_ERROR_UNSUPPORTED_OPERATION: u32 = 524307;
pub const BLPAPI_ERROR_DS_PROPERTY_NOT_FOUND: u32 = 393236;
pub const BLPAPI_ERROR_MSG_TOO_LARGE: u32 = 131093;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const BLPAPI_DEPRECATE_SEVERITY_LEVEL_NOTIFICATION: u32 = 1;
pub const BLPAPI_DEPRECATE_SEVERITY_LEVEL_STANDARD: u32 = 64;
pub const BLPAPI_DEPRECATE_SEVERITY_LEVEL_CRITICAL: u32 = 128;
pub const BLPAPI_DEPRECATE_SEVERITY_THRESHOLD: u32 = 0;
pub const BLPAPI_DEPRECATE_STAGE_LEVEL_DEFAULT_NO_WARNING: u32 = 64;
pub const BLPAPI_DEPRECATE_STAGE_LEVEL_DEFAULT_WARNING: u32 = 128;
pub const BLPAPI_DEPRECATE_STAGE_LEVEL_REMOVAL: u32 = 254;
pub const BLPAPI_DEPRECATE_STAGE_THRESHOLD: u32 = 128;
pub const BLPAPI_DEPRECATE_MESSAGE_TOPIC_NAME__ENABLED: u32 = 1;
pub const BLPAPI_DEPRECATE_ABSTRACT_SESSION_CREATE_USER_HANDLE__ENABLED: u32 = 1;
pub const BLPAPI_DEPRECATE_STRING_NAME__ENABLED: u32 = 1;
pub const BLPAPI_DEPRECATE_PRERESOLVED_TOPICS__ENABLED: u32 = 1;
pub const BLPAPI_VERSION_MAJOR: u32 = 3;
pub const BLPAPI_VERSION_MINOR: u32 = 25;
pub const BLPAPI_VERSION_PATCH: u32 = 11;
pub const BLPAPI_VERSION_BUILD: u32 = 1;
pub type va_list = *mut ::core::ffi::c_char;
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::core::ffi::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::core::ffi::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
unsafe extern "C" {
    pub fn blpapi_getLastErrorDescription(
        resultCode: ::core::ffi::c_int,
    ) -> *const ::core::ffi::c_char;
}
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_exception\n @{"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_ErrorInfo {
    pub exceptionClass: ::core::ffi::c_int,
    pub description: [::core::ffi::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_ErrorInfo"][::core::mem::size_of::<blpapi_ErrorInfo>() - 260usize];
    ["Alignment of blpapi_ErrorInfo"][::core::mem::align_of::<blpapi_ErrorInfo>() - 4usize];
    ["Offset of field: blpapi_ErrorInfo::exceptionClass"]
        [::core::mem::offset_of!(blpapi_ErrorInfo, exceptionClass) - 0usize];
    ["Offset of field: blpapi_ErrorInfo::description"]
        [::core::mem::offset_of!(blpapi_ErrorInfo, description) - 4usize];
};
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_exception\n @{"]
pub type blpapi_ErrorInfo_t = blpapi_ErrorInfo;
unsafe extern "C" {
    pub fn blpapi_getErrorInfo(
        buffer: *mut blpapi_ErrorInfo_t,
        errorCode: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_types\n @{\n <A NAME=\"purpose\"></A>\n <A NAME=\"1\"> \\par Purpose: </A>\n Provide BLPAPI types.\n \\par\n \\par\n <A NAME=\"classes\"></A>\n <A NAME=\"2\"> \\par Classes: </A>\n <table>\n <tr>\n <td>blpapi::DataType</td>\n <td>Data types in the schema</td>\n </tr>\n <tr>\n <td>blpapi::Bytes</td>\n <td>Represents a byte array</td>\n </tr>\n </table>\n \\par\n \\par\n <A NAME=\"description\"></A>\n <A NAME=\"3\"> \\par Description: </A>\n  This component implements BLPAPI types.\n/\n/** @} */\n/** @}"]
pub type blpapi_Bool_t = ::core::ffi::c_int;
pub type blpapi_Char_t = ::core::ffi::c_char;
pub type blpapi_UChar_t = ::core::ffi::c_uchar;
pub type blpapi_Int16_t = ::core::ffi::c_short;
pub type blpapi_UInt16_t = ::core::ffi::c_ushort;
pub type blpapi_Int32_t = ::core::ffi::c_int;
pub type blpapi_UInt32_t = ::core::ffi::c_uint;
pub type blpapi_Int64_t = ::core::ffi::c_longlong;
pub type blpapi_UInt64_t = ::core::ffi::c_ulonglong;
pub type blpapi_Float32_t = f32;
pub type blpapi_Float64_t = f64;
#[doc = "< Bool"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_BOOL: blpapi_DataType_t = 1;
#[doc = "< Char"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_CHAR: blpapi_DataType_t = 2;
#[doc = "< Unsigned 8 bit value"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_BYTE: blpapi_DataType_t = 3;
#[doc = "< 32 bit Integer"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_INT32: blpapi_DataType_t = 4;
#[doc = "< 64 bit Integer"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_INT64: blpapi_DataType_t = 5;
#[doc = "< 32 bit Floating point - IEEE"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_FLOAT32: blpapi_DataType_t = 6;
#[doc = "< 64 bit Floating point - IEEE"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_FLOAT64: blpapi_DataType_t = 7;
#[doc = "< ASCIIZ string"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_STRING: blpapi_DataType_t = 8;
#[doc = "< Opaque binary data"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_BYTEARRAY: blpapi_DataType_t = 9;
#[doc = "< Date"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_DATE: blpapi_DataType_t = 10;
#[doc = "< Timestamp"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_TIME: blpapi_DataType_t = 11;
#[doc = "<"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_DECIMAL: blpapi_DataType_t = 12;
#[doc = "< Date and time"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_DATETIME: blpapi_DataType_t = 13;
#[doc = "< An opaque enumeration"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_ENUMERATION: blpapi_DataType_t = 14;
#[doc = "< Sequence type"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_SEQUENCE: blpapi_DataType_t = 15;
#[doc = "< Choice type"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_CHOICE: blpapi_DataType_t = 16;
#[doc = "< Used for some internal messages"]
pub const blpapi_DataType_t_BLPAPI_DATATYPE_CORRELATION_ID: blpapi_DataType_t = 17;
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_types\n @{"]
pub type blpapi_DataType_t = ::core::ffi::c_int;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_OFF: blpapi_Logging_Severity_t = 0;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_FATAL: blpapi_Logging_Severity_t = 1;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_ERROR: blpapi_Logging_Severity_t = 2;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_WARN: blpapi_Logging_Severity_t = 3;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_INFO: blpapi_Logging_Severity_t = 4;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_DEBUG: blpapi_Logging_Severity_t = 5;
pub const blpapi_Logging_Severity_t_blpapi_Logging_SEVERITY_TRACE: blpapi_Logging_Severity_t = 6;
pub type blpapi_Logging_Severity_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_AbstractSession {
    _unused: [u8; 0],
}
pub type blpapi_AbstractSession_t = blpapi_AbstractSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Constant {
    _unused: [u8; 0],
}
pub type blpapi_Constant_t = blpapi_Constant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_ConstantList {
    _unused: [u8; 0],
}
pub type blpapi_ConstantList_t = blpapi_ConstantList;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Element {
    _unused: [u8; 0],
}
pub type blpapi_Element_t = blpapi_Element;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Event {
    _unused: [u8; 0],
}
pub type blpapi_Event_t = blpapi_Event;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_EventDispatcher {
    _unused: [u8; 0],
}
pub type blpapi_EventDispatcher_t = blpapi_EventDispatcher;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_EventFormatter {
    _unused: [u8; 0],
}
pub type blpapi_EventFormatter_t = blpapi_EventFormatter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_EventQueue {
    _unused: [u8; 0],
}
pub type blpapi_EventQueue_t = blpapi_EventQueue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_MessageIterator {
    _unused: [u8; 0],
}
pub type blpapi_MessageIterator_t = blpapi_MessageIterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Name {
    _unused: [u8; 0],
}
pub type blpapi_Name_t = blpapi_Name;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Operation {
    _unused: [u8; 0],
}
pub type blpapi_Operation_t = blpapi_Operation;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_ProviderSession {
    _unused: [u8; 0],
}
pub type blpapi_ProviderSession_t = blpapi_ProviderSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_RequestTemplate {
    _unused: [u8; 0],
}
pub type blpapi_RequestTemplate_t = blpapi_RequestTemplate;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Service {
    _unused: [u8; 0],
}
pub type blpapi_Service_t = blpapi_Service;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Session {
    _unused: [u8; 0],
}
pub type blpapi_Session_t = blpapi_Session;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_SessionOptions {
    _unused: [u8; 0],
}
pub type blpapi_SessionOptions_t = blpapi_SessionOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Socks5Config {
    _unused: [u8; 0],
}
pub type blpapi_Socks5Config_t = blpapi_Socks5Config;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_TlsOptions {
    _unused: [u8; 0],
}
pub type blpapi_TlsOptions_t = blpapi_TlsOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_SubscriptionItrerator {
    _unused: [u8; 0],
}
pub type blpapi_SubscriptionIterator_t = blpapi_SubscriptionItrerator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Identity {
    _unused: [u8; 0],
}
pub type blpapi_UserHandle = blpapi_Identity;
pub type blpapi_UserHandle_t = blpapi_Identity;
pub type blpapi_Identity_t = blpapi_Identity;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_SchemaElementDefinition {
    _unused: [u8; 0],
}
pub type blpapi_SchemaElementDefinition_t = blpapi_SchemaElementDefinition;
pub type blpapi_Datetime_t = blpapi_Datetime_tag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_MessageFormatter {
    _unused: [u8; 0],
}
pub type blpapi_MessageFormatter_t = blpapi_MessageFormatter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_MessageProperties {
    _unused: [u8; 0],
}
pub type blpapi_MessageProperties_t = blpapi_MessageProperties;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_AuthOptions {
    _unused: [u8; 0],
}
pub type blpapi_AuthOptions_t = blpapi_AuthOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_AuthUser {
    _unused: [u8; 0],
}
pub type blpapi_AuthUser_t = blpapi_AuthUser;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_AuthApplication {
    _unused: [u8; 0],
}
pub type blpapi_AuthApplication_t = blpapi_AuthApplication;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_AuthToken {
    _unused: [u8; 0],
}
pub type blpapi_AuthToken_t = blpapi_AuthToken;
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::core::ffi::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::core::ffi::c_int;
pub type wint_t = ::core::ffi::c_ushort;
pub type wctype_t = ::core::ffi::c_ushort;
pub type __time32_t = ::core::ffi::c_long;
pub type __time64_t = ::core::ffi::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::core::ffi::c_ushort,
    pub _locale_mb_cur_max: ::core::ffi::c_int,
    pub _locale_lc_codepage: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::core::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::core::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::core::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::core::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::core::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::core::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::core::ffi::c_ulong,
    pub _Byte: ::core::ffi::c_ushort,
    pub _State: ::core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::core::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::core::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::core::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::core::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::core::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
    pub fn _errno() -> *mut ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _set_errno(_Value: ::core::ffi::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_errno(_Value: *mut ::core::ffi::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn __threadid() -> ::core::ffi::c_ulong;
}
unsafe extern "C" {
    pub fn __threadhandle() -> usize;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_create_default(
        options: *mut *mut blpapi_AuthOptions_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_create_forUserMode(
        options: *mut *mut blpapi_AuthOptions_t,
        user: *const blpapi_AuthUser_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_create_forAppMode(
        options: *mut *mut blpapi_AuthOptions_t,
        app: *const blpapi_AuthApplication_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_create_forUserAndAppMode(
        options: *mut *mut blpapi_AuthOptions_t,
        user: *const blpapi_AuthUser_t,
        app: *const blpapi_AuthApplication_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_create_forToken(
        options: *mut *mut blpapi_AuthOptions_t,
        token: *const blpapi_AuthToken_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_duplicate(
        options: *mut *mut blpapi_AuthOptions_t,
        dup: *const blpapi_AuthOptions_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_copy(
        lhs: *mut blpapi_AuthOptions_t,
        rhs: *const blpapi_AuthOptions_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthOptions_destroy(options: *mut blpapi_AuthOptions_t);
}
unsafe extern "C" {
    pub fn blpapi_AuthUser_createWithLogonName(
        user: *mut *mut blpapi_AuthUser_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthUser_createWithActiveDirectoryProperty(
        user: *mut *mut blpapi_AuthUser_t,
        propertyName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthUser_createWithManualOptions(
        user: *mut *mut blpapi_AuthUser_t,
        userId: *const ::core::ffi::c_char,
        ipAddress: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthUser_duplicate(
        user: *mut *mut blpapi_AuthUser_t,
        dup: *const blpapi_AuthUser_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthUser_copy(
        lhs: *mut blpapi_AuthUser_t,
        rhs: *const blpapi_AuthUser_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthUser_destroy(user: *mut blpapi_AuthUser_t);
}
unsafe extern "C" {
    pub fn blpapi_AuthApplication_create(
        app: *mut *mut blpapi_AuthApplication_t,
        appName: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthApplication_duplicate(
        app: *mut *mut blpapi_AuthApplication_t,
        dup: *const blpapi_AuthApplication_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthApplication_copy(
        lhs: *mut blpapi_AuthApplication_t,
        rhs: *const blpapi_AuthApplication_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthApplication_destroy(app: *mut blpapi_AuthApplication_t);
}
unsafe extern "C" {
    pub fn blpapi_AuthToken_create(
        token: *mut *mut blpapi_AuthToken_t,
        tokenStr: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthToken_duplicate(
        token: *mut *mut blpapi_AuthToken_t,
        dup: *const blpapi_AuthToken_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthToken_copy(
        lhs: *mut blpapi_AuthToken_t,
        rhs: *const blpapi_AuthToken_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_AuthToken_destroy(token: *mut blpapi_AuthToken_t);
}
#[doc = "! \\cond INTERNAL"]
pub type blpapi_ManagedPtr_t = blpapi_ManagedPtr_t_;
pub type blpapi_ManagedPtr_ManagerFunction_t = ::core::option::Option<
    unsafe extern "C" fn(
        managedPtr: *mut blpapi_ManagedPtr_t,
        srcPtr: *const blpapi_ManagedPtr_t,
        operation: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub union blpapi_ManagedPtr_t_data_ {
    pub intValue: ::core::ffi::c_int,
    pub ptr: *mut ::core::ffi::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_ManagedPtr_t_data_"]
        [::core::mem::size_of::<blpapi_ManagedPtr_t_data_>() - 8usize];
    ["Alignment of blpapi_ManagedPtr_t_data_"]
        [::core::mem::align_of::<blpapi_ManagedPtr_t_data_>() - 8usize];
    ["Offset of field: blpapi_ManagedPtr_t_data_::intValue"]
        [::core::mem::offset_of!(blpapi_ManagedPtr_t_data_, intValue) - 0usize];
    ["Offset of field: blpapi_ManagedPtr_t_data_::ptr"]
        [::core::mem::offset_of!(blpapi_ManagedPtr_t_data_, ptr) - 0usize];
};
#[doc = "! \\cond INTERNAL"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct blpapi_ManagedPtr_t_ {
    pub pointer: *mut ::core::ffi::c_void,
    pub userData: [blpapi_ManagedPtr_t_data_; 4usize],
    pub manager: blpapi_ManagedPtr_ManagerFunction_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_ManagedPtr_t_"][::core::mem::size_of::<blpapi_ManagedPtr_t_>() - 48usize];
    ["Alignment of blpapi_ManagedPtr_t_"][::core::mem::align_of::<blpapi_ManagedPtr_t_>() - 8usize];
    ["Offset of field: blpapi_ManagedPtr_t_::pointer"]
        [::core::mem::offset_of!(blpapi_ManagedPtr_t_, pointer) - 0usize];
    ["Offset of field: blpapi_ManagedPtr_t_::userData"]
        [::core::mem::offset_of!(blpapi_ManagedPtr_t_, userData) - 8usize];
    ["Offset of field: blpapi_ManagedPtr_t_::manager"]
        [::core::mem::offset_of!(blpapi_ManagedPtr_t_, manager) - 40usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct blpapi_CorrelationId_t_ {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub value: blpapi_CorrelationId_t___bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union blpapi_CorrelationId_t___bindgen_ty_1 {
    pub intValue: blpapi_UInt64_t,
    pub ptrValue: blpapi_ManagedPtr_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_CorrelationId_t___bindgen_ty_1"]
        [::core::mem::size_of::<blpapi_CorrelationId_t___bindgen_ty_1>() - 48usize];
    ["Alignment of blpapi_CorrelationId_t___bindgen_ty_1"]
        [::core::mem::align_of::<blpapi_CorrelationId_t___bindgen_ty_1>() - 8usize];
    ["Offset of field: blpapi_CorrelationId_t___bindgen_ty_1::intValue"]
        [::core::mem::offset_of!(blpapi_CorrelationId_t___bindgen_ty_1, intValue) - 0usize];
    ["Offset of field: blpapi_CorrelationId_t___bindgen_ty_1::ptrValue"]
        [::core::mem::offset_of!(blpapi_CorrelationId_t___bindgen_ty_1, ptrValue) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_CorrelationId_t_"]
        [::core::mem::size_of::<blpapi_CorrelationId_t_>() - 56usize];
    ["Alignment of blpapi_CorrelationId_t_"]
        [::core::mem::align_of::<blpapi_CorrelationId_t_>() - 8usize];
    ["Offset of field: blpapi_CorrelationId_t_::value"]
        [::core::mem::offset_of!(blpapi_CorrelationId_t_, value) - 8usize];
};
impl blpapi_CorrelationId_t_ {
    #[inline]
    pub fn size(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_size(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn size_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_size_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn valueType(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_valueType(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn valueType_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_valueType_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn classId(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_classId(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn classId_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                16u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_classId_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                16u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn internalClassId(&self) -> ::core::ffi::c_uint {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_internalClassId(&mut self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn internalClassId_raw(this: *const Self) -> ::core::ffi::c_uint {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_internalClassId_raw(this: *mut Self, val: ::core::ffi::c_uint) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        size: ::core::ffi::c_uint,
        valueType: ::core::ffi::c_uint,
        classId: ::core::ffi::c_uint,
        internalClassId: ::core::ffi::c_uint,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let size: u32 = unsafe { ::core::mem::transmute(size) };
            size as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let valueType: u32 = unsafe { ::core::mem::transmute(valueType) };
            valueType as u64
        });
        __bindgen_bitfield_unit.set(12usize, 16u8, {
            let classId: u32 = unsafe { ::core::mem::transmute(classId) };
            classId as u64
        });
        __bindgen_bitfield_unit.set(28usize, 4u8, {
            let internalClassId: u32 = unsafe { ::core::mem::transmute(internalClassId) };
            internalClassId as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type blpapi_CorrelationId_t = blpapi_CorrelationId_t_;
unsafe extern "C" {
    pub fn blpapi_CorrelationId_managedPtrAddRef(
        numRef: *mut ::core::ffi::c_int,
        cid: *mut blpapi_CorrelationId_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_CorrelationId_managedPtrRelease(
        numRef: *mut ::core::ffi::c_int,
        cid: *mut blpapi_CorrelationId_t,
    ) -> ::core::ffi::c_int;
}
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_streamproxy\n @{\n <A NAME=\"purpose\"></A>\n <A NAME=\"1\"> \\par Purpose: </A>\n A signature for callback on print and default C++ implementation\n \\par\n \\par\n <A NAME=\"description\"></A>\n <A NAME=\"2\"> \\par Description: </A>\n\n This file defines <code>blpapi_StreamWriter_t</code> a function pointer\n type. The user of the C API need to specify a callback of above type which\n will be called on xxx_print(...) with the formatted data. For C++ API, a\n default callback is specified which writes data to the stream specified in\n xxx::print\n/\n/** @} */\n/** @}"]
pub type blpapi_StreamWriter_t = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const ::core::ffi::c_char,
        length: ::core::ffi::c_int,
        stream: *mut ::core::ffi::c_void,
    ) -> ::core::ffi::c_int,
>;
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_timepoint\n @{\n/\n/*!\n This struct provides an <em>in-core</em> <em>value</em> <em>semantic</em>\n type for representing a single moment in time, assuming a simple linear\n model of time. The precision of such representations is guaranteed to be at\n least at the granularity of nanoseconds, but only times relatively near\n (within a few years of) the current moment are guaranteed to be\n representable. The actual implementation of a time point is\n implementation-defined and opaque to client code; in particular, time points\n can <em>not</em> be transferred between processes. (The SDK reserves the\n right to alter the epoch used as a base from run to run.) Clients wishing to\n persist time points should use the\n <code>TimePointUtil::nanosecondsBetween</code> function to measure distance\n from a known epoch value, or convert the time point to some standard\n calendar and wall-clock convention (e.g.  <code>blpapi::Datetime</code>).\n/\n/*!\n See \\ref blpapi_timepoint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_TimePoint {
    pub d_value: blpapi_Int64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_TimePoint"][::core::mem::size_of::<blpapi_TimePoint>() - 8usize];
    ["Alignment of blpapi_TimePoint"][::core::mem::align_of::<blpapi_TimePoint>() - 8usize];
    ["Offset of field: blpapi_TimePoint::d_value"]
        [::core::mem::offset_of!(blpapi_TimePoint, d_value) - 0usize];
};
#[doc = " \\addtogroup blpapi\n @{\n/\n/** \\addtogroup blpapi_timepoint\n @{\n/\n/*!\n This struct provides an <em>in-core</em> <em>value</em> <em>semantic</em>\n type for representing a single moment in time, assuming a simple linear\n model of time. The precision of such representations is guaranteed to be at\n least at the granularity of nanoseconds, but only times relatively near\n (within a few years of) the current moment are guaranteed to be\n representable. The actual implementation of a time point is\n implementation-defined and opaque to client code; in particular, time points\n can <em>not</em> be transferred between processes. (The SDK reserves the\n right to alter the epoch used as a base from run to run.) Clients wishing to\n persist time points should use the\n <code>TimePointUtil::nanosecondsBetween</code> function to measure distance\n from a known epoch value, or convert the time point to some standard\n calendar and wall-clock convention (e.g.  <code>blpapi::Datetime</code>).\n/\n/*!\n See \\ref blpapi_timepoint"]
pub type blpapi_TimePoint_t = blpapi_TimePoint;
unsafe extern "C" {
    pub fn blpapi_TimePointUtil_nanosecondsBetween(
        start: *const blpapi_TimePoint_t,
        end: *const blpapi_TimePoint_t,
    ) -> ::core::ffi::c_longlong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_Datetime_tag {
    #[doc = "  bitmask of date/time parts that are set"]
    pub parts: blpapi_UChar_t,
    pub hours: blpapi_UChar_t,
    pub minutes: blpapi_UChar_t,
    pub seconds: blpapi_UChar_t,
    pub milliSeconds: blpapi_UInt16_t,
    pub month: blpapi_UChar_t,
    pub day: blpapi_UChar_t,
    pub year: blpapi_UInt16_t,
    pub offset: blpapi_Int16_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_Datetime_tag"][::core::mem::size_of::<blpapi_Datetime_tag>() - 12usize];
    ["Alignment of blpapi_Datetime_tag"][::core::mem::align_of::<blpapi_Datetime_tag>() - 2usize];
    ["Offset of field: blpapi_Datetime_tag::parts"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, parts) - 0usize];
    ["Offset of field: blpapi_Datetime_tag::hours"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, hours) - 1usize];
    ["Offset of field: blpapi_Datetime_tag::minutes"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, minutes) - 2usize];
    ["Offset of field: blpapi_Datetime_tag::seconds"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, seconds) - 3usize];
    ["Offset of field: blpapi_Datetime_tag::milliSeconds"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, milliSeconds) - 4usize];
    ["Offset of field: blpapi_Datetime_tag::month"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, month) - 6usize];
    ["Offset of field: blpapi_Datetime_tag::day"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, day) - 7usize];
    ["Offset of field: blpapi_Datetime_tag::year"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, year) - 8usize];
    ["Offset of field: blpapi_Datetime_tag::offset"]
        [::core::mem::offset_of!(blpapi_Datetime_tag, offset) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blpapi_HighPrecisionDatetime_tag {
    pub datetime: blpapi_Datetime_t,
    pub picoseconds: blpapi_UInt32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blpapi_HighPrecisionDatetime_tag"]
        [::core::mem::size_of::<blpapi_HighPrecisionDatetime_tag>() - 16usize];
    ["Alignment of blpapi_HighPrecisionDatetime_tag"]
        [::core::mem::align_of::<blpapi_HighPrecisionDatetime_tag>() - 4usize];
    ["Offset of field: blpapi_HighPrecisionDatetime_tag::datetime"]
        [::core::mem::offset_of!(blpapi_HighPrecisionDatetime_tag, datetime) - 0usize];
    ["Offset of field: blpapi_HighPrecisionDatetime_tag::picoseconds"]
        [::core::mem::offset_of!(blpapi_HighPrecisionDatetime_tag, picoseconds) - 12usize];
};
pub type blpapi_HighPrecisionDatetime_t = blpapi_HighPrecisionDatetime_tag;
unsafe extern "C" {
    pub fn blpapi_Datetime_compare(
        lhs: blpapi_Datetime_t,
        rhs: blpapi_Datetime_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_Datetime_print(
        datetime: *const blpapi_Datetime_t,
        streamWriter: blpapi_StreamWriter_t,
        stream: *mut ::core::ffi::c_void,
        level: ::core::ffi::c_int,
        spacesPerLevel: ::core::ffi::c_int,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_HighPrecisionDatetime_compare(
        lhs: *const blpapi_HighPrecisionDatetime_t,
        rhs: *const blpapi_HighPrecisionDatetime_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn blpapi_HighPrecisionDatetime_print(
